{
  "backend/main.mo": "Main canister defining authorization, storage mixins, and comprehensive types for repairs, assistance requests, verification, insurance, disputes, memberships, and mechanic/garage data models.",
  "backend/migration.mo": "Migration module converting old assistance requests by adding an assignedMechanic field while preserving existing state.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend components and pages for documentation or build planning.",
  "frontend/index.css": "Global Tailwind CSS configuration defining OKLCH color variables and theme styles for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Main router configuration defining routes, layout, navigation, admin tools, dashboards, and feature pages.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component that checks admin status and redirects non-admin users while showing a loading skeleton when necessary.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and automatic re-authentication handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter name, optional email, and select roles before saving their profile.",
  "frontend/src/components/booking/GarageBookingModal.tsx": "Garage booking flow with tabs for details, assistance, and payment, handling auth, waiver signing, and booking creation.",
  "frontend/src/components/booking/MechanicAssistanceAddon.tsx": "UI card allowing users to request mechanic assistance and specify service type and details.",
  "frontend/src/components/booking/PricingBreakdown.tsx": "Displays itemized pricing including base rate, addons, discounts, and final total.",
  "frontend/src/components/coming-soon/ComingSoonBadge.tsx": "Small badge component indicating that a feature is coming soon.",
  "frontend/src/components/coming-soon/SimulatedFlowModal.tsx": "Simulated step-by-step flow modal with progress tracking and a completion screen for upcoming features.",
  "frontend/src/components/common/Typography.tsx": "Exports styled page and section title components for consistent typography.",
  "frontend/src/components/diy/DIYSupportModal.tsx": "Authenticated modal offering tabs for tool recommendations, cost estimation, and consultation preview.",
  "frontend/src/components/diy/RepairCostEstimatorSection.tsx": "Form for creating repair cost estimates and saving them using backend mutations.",
  "frontend/src/components/diy/ToolRecommendationsSection.tsx": "UI for selecting a repair category and displaying recommended tools and consumables, with save-to-session support.",
  "frontend/src/components/diy/VideoConsultationComingSoon.tsx": "Displays a coming‑soon video consultation feature with pricing, included features, and a simulated booking flow.",
  "frontend/src/components/garages/GarageCard.tsx": "Clickable garage listing card showing location, rates, and available tools, navigating to the garage detail page.",
  "frontend/src/components/garages/GarageFilters.tsx": "Form controls for filtering garages by location, price range, and requirements such as deposits or waivers.",
  "frontend/src/components/garages/GaragePhotoGallery.tsx": "Photo grid and modal viewer for garage images with next/previous navigation and placeholder fallback.",
  "frontend/src/components/layout/PageLayout.tsx": "Simple layout wrapper applying container width and padding based on a configurable maxWidth.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with links, authentication handling, user menu, admin options, and mobile menu support.",
  "frontend/src/components/mechanics/MechanicCard.tsx": "Clickable mechanic card showing name, location, rate, rating, and specialization with verification badges.",
  "frontend/src/components/mechanics/MechanicFilters.tsx": "Filter panel allowing users to filter mechanics by location, specialization, rate range, and verification status.",
  "frontend/src/components/mechanics/MechanicVerificationBadges.tsx": "Displays a colored badge showing a mechanic’s verification status using icons for verified, pending, or rejected.",
  "frontend/src/components/notifications/NotificationDropdown.tsx": "Renders a dropdown showing recent notifications, unread count, icons, timestamps, and navigation to the notifications page.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Shows the active payment method, emphasizing test-mode escrow processing with descriptive UI elements.",
  "frontend/src/components/payments/TransactionHistoryList.tsx": "Displays a table of transactions with amounts, fees, status badges, and formatted timestamps, or an empty state if none exist.",
  "frontend/src/components/payments/TransactionStatusBadge.tsx": "Maps transaction status values to badge variants and labels for display.",
  "frontend/src/components/reviews/ReviewList.tsx": "Shows a list of reviews with star ratings, comments, and dates, or an empty state with optional average rating.",
  "frontend/src/components/uploads/FileUploader.tsx": "Provides a file upload UI with validation, progress simulation, limits, and callback handling.",
  "frontend/src/components/waivers/WaiverSigningModal.tsx": "Modal for reading and electronically signing a liability waiver with name input and agreement checkbox.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useNotifications.ts": "Implements React Query hooks for fetching and updating user notifications, currently using placeholder backend calls.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous React Query hooks for interacting with actor-based backend APIs for profiles, tools, estimates, and related entities.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/types.ts": "Contains TypeScript interfaces and enums for garage, mechanic, booking, transaction, notification, and revenue domain models.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDenied.tsx": "Renders an access denied page with messaging and a link back home.",
  "frontend/src/pages/admin/DemandHeatmap.tsx": "Shows an admin page placeholder for demand heatmap data.",
  "frontend/src/pages/admin/DisputeTools.tsx": "Displays an admin page placeholder for dispute resolution tools.",
  "frontend/src/pages/admin/EscrowTransactions.tsx": "Admin page listing escrow transactions with filtering and actions to release or refund funds.",
  "frontend/src/pages/admin/FeaturedBoostManagement.tsx": "Admin page showing pending featured boost requests, currently empty.",
  "frontend/src/pages/admin/InsuranceReview.tsx": "Admin page for reviewing insurance documents, currently with no pending items.",
  "frontend/src/pages/admin/MarketplaceModeration.tsx": "Admin moderation page for mechanics and garages, both showing no pending reviews.",
  "frontend/src/pages/admin/NoShowPenalties.tsx": "Admin page displaying recorded no‑show penalties, currently none.",
  "frontend/src/pages/admin/RevenueTracking.tsx": "Admin dashboard showing revenue totals, breakdowns, and fee configuration.",
  "frontend/src/pages/admin/ReviewModeration.tsx": "Admin page for moderating mechanic and garage reviews, currently empty.",
  "frontend/src/pages/admin/UserRoleManagement.tsx": "Displays role descriptions and notes that admin roles cannot be self‑assigned.",
  "frontend/src/pages/admin/VerificationQueue.tsx": "Admin interface to approve or reject identity verification requests with optional notes.",
  "frontend/src/pages/admin/WaitlistManagement.tsx": "Admin page for viewing waitlist entries, currently none.",
  "frontend/src/pages/admin/WaiverRecords.tsx": "Admin page listing waiver records, currently empty.",
  "frontend/src/pages/coming-soon/UnsupportedFeaturesHub.tsx": "Shows upcoming features and allows previewing simulated flows for each.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Renders an admin dashboard with cards linking to various moderation and management tools using a list of tool definitions.",
  "frontend/src/pages/dashboards/CustomerDashboard.tsx": "Displays customer bookings, pending reviews, and recent transactions, with sign‑in gating when identity is missing.",
  "frontend/src/pages/dashboards/GarageOwnerDashboard.tsx": "Shows garage owners their listings, availability, and requests, or prompts them to create a listing if none exist.",
  "frontend/src/pages/dashboards/MechanicDashboard.tsx": "Provides mechanics with profile management, availability, incoming requests, and emergency service controls, or prompts them to create a profile.",
  "frontend/src/pages/disputes/Disputes.tsx": "Allows users to view and open disputes, including a dialog form for submitting booking IDs and reasons with authentication gating.",
  "frontend/src/pages/fix-my-car/FixMyCarIntake.tsx": "Collects issue descriptions and media uploads for a car‑repair intake flow and navigates to results after submission.",
  "frontend/src/pages/fix-my-car/FixMyCarResults.tsx": "Displays recommended repair cost and options to browse mechanics or DIY garages.",
  "frontend/src/pages/garages/GarageBrowse.tsx": "Provides filters and tabbed list/map views for browsing rentable garages.",
  "frontend/src/pages/garages/GarageDetail.tsx": "Shows detailed garage info including photos, tools, status, and booking/DIY support modals.",
  "frontend/src/pages/garages/GarageListingEditor.tsx": "Placeholder page for an upcoming garage listing editor.",
  "frontend/src/pages/Landing.tsx": "Implements the marketing-focused landing page with hero content, features, and navigation links.",
  "frontend/src/pages/mechanics/MechanicBrowse.tsx": "Displays searchable, filterable list of mechanics with loading skeletons.",
  "frontend/src/pages/mechanics/MechanicProfileEditor.tsx": "Placeholder page for editing a mechanic’s profile.",
  "frontend/src/pages/mechanics/MechanicProfilePublic.tsx": "Simple public view showing a mechanic’s profile by ID with a back link.",
  "frontend/src/pages/notifications/NotificationCenter.tsx": "Displays user notifications with filtering, icons, and mark-as-read actions.",
  "frontend/src/pages/payments/TransactionHistory.tsx": "Shows authenticated users their transaction and escrow history with loading states.",
  "frontend/src/pages/settings/MembershipSettings.tsx": "Allows users to view and manage DIY and Pro membership statuses and benefits.",
  "frontend/src/pages/trust-safety/IdentityVerification.tsx": "React page showing identity verification status, prompting login if unauthenticated and allowing document upload if logged in.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing the app’s architecture, requirements, known issues, and implemented features for a vehicle-services marketplace."
}