{
  "backend/main.mo": "Defines the actor’s core domain types for repairs, assistance, verification, documents, disputes, memberships, revenue, and mechanic/garage data, including authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files including components, pages, and libraries.",
  "frontend/index.css": "Tailwind base/style layers defining OKLCH theme variables, light/dark modes, and global element styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Configures app routing, layout, navigation, and page components using TanStack Router.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that checks admin status and handles redirects or loading skeletons.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that prompts authenticated users without a profile to enter name, email, and select roles, then saves the profile.",
  "frontend/src/components/booking/GarageBookingModal.tsx": "Garage booking modal with tabs for details, assistance, and payment, requiring sign‑in and handling waiver confirmation.",
  "frontend/src/components/booking/MechanicAssistanceAddon.tsx": "UI card for toggling mechanic assistance and specifying service type and details.",
  "frontend/src/components/booking/PricingBreakdown.tsx": "Displays a pricing summary including base price, addons, discounts, and total.",
  "frontend/src/components/coming-soon/ComingSoonBadge.tsx": "Badge component showing a 'Coming Soon' label with an icon.",
  "frontend/src/components/coming-soon/SimulatedFlowModal.tsx": "Modal that simulates multi‑step flows with progress, completion state, and a coming‑soon notice.",
  "frontend/src/components/common/Typography.tsx": "Provides PageTitle and SectionTitle components for consistent typography styling.",
  "frontend/src/components/diy/DIYSupportModal.tsx": "Authenticated DIY support modal offering tool recommendations, cost estimator, and consultation tabs.",
  "frontend/src/components/diy/RepairCostEstimatorSection.tsx": "Form for creating repair cost estimates and viewing recent estimates, validating input and sending mutations.",
  "frontend/src/components/diy/ToolRecommendationsSection.tsx": "Renders a repair-type selector and shows recommended tools and consumables based on selected category, with an option to save the selection.",
  "frontend/src/components/diy/VideoConsultationComingSoon.tsx": "Displays a coming-soon video consultation feature with details, pricing, and a simulated booking flow modal.",
  "frontend/src/components/garages/GarageCard.tsx": "Shows a garage’s location, rates, and tools, and navigates to the garage detail page when clicked.",
  "frontend/src/components/garages/GarageFilters.tsx": "Provides filter inputs for garage search including location, hourly price range, and requirement checkboxes.",
  "frontend/src/components/garages/GaragePhotoGallery.tsx": "Displays a grid of garage photos with a modal viewer and navigation controls for browsing images.",
  "frontend/src/components/layout/PageLayout.tsx": "Wraps children in a responsive container with configurable max-width.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with links, user menu, role-based dashboard options, and mobile navigation.",
  "frontend/src/components/mechanics/MechanicCard.tsx": "Displays mechanic details including name, location, rate, rating, and specializations, and navigates to their profile.",
  "frontend/src/components/mechanics/MechanicFilters.tsx": "Provides filter controls for mechanics including location, specialization, rate range, and verification status.",
  "frontend/src/components/mechanics/MechanicVerificationBadges.tsx": "Displays a badge showing a mechanic’s verification status with different icons and colors for verified, pending, or rejected.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Renders a payment method selector with card, Apple Pay, and Google Pay options, triggering a simulated flow for unsupported methods.",
  "frontend/src/components/reviews/ReviewList.tsx": "Shows a list of reviews with star ratings and timestamps, or a fallback message when no reviews exist.",
  "frontend/src/components/uploads/FileUploader.tsx": "Provides a file upload button with validation, simulated progress, and callbacks for selected files.",
  "frontend/src/components/waivers/WaiverSigningModal.tsx": "Modal allowing users to read a waiver and sign by entering their name and agreeing to terms.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity context to components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin checks, tool recommendations, and repair estimates using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base layers and defines extensive CSS variables for light and dark themes.",
  "frontend/src/lib/types.ts": "Defines TypeScript interfaces and enums for garage listings, mechanic profiles, reviews, and search filters.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AccessDenied.tsx": "Displays an access denied message with a card layout and a link back to the homepage.",
  "frontend/src/pages/admin/DemandHeatmap.tsx": "Admin page placeholder showing a card stating that no demand data is available.",
  "frontend/src/pages/admin/DisputeTools.tsx": "Admin page placeholder for dispute resolution, indicating no active disputes.",
  "frontend/src/pages/admin/FeaturedBoostManagement.tsx": "Admin page displaying a placeholder for managing featured boost requests.",
  "frontend/src/pages/admin/InsuranceReview.tsx": "Admin page placeholder indicating no insurance documents are pending review.",
  "frontend/src/pages/admin/MarketplaceModeration.tsx": "Admin moderation page with tabs for mechanics and garages, each showing no pending items.",
  "frontend/src/pages/admin/NoShowPenalties.tsx": "Admin page placeholder showing that no no‑show penalties are recorded.",
  "frontend/src/pages/admin/RevenueTracking.tsx": "Admin dashboard showing revenue totals, breakdowns, and fee configuration using query hooks.",
  "frontend/src/pages/admin/ReviewModeration.tsx": "Admin page with tabs for moderating mechanic and garage reviews, currently showing no pending reviews.",
  "frontend/src/pages/admin/UserRoleManagement.tsx": "Admin page describing the application's role system and restrictions on admin role assignment.",
  "frontend/src/pages/admin/VerificationQueue.tsx": "Displays identity verification submissions and allows admins to approve or reject them with optional notes.",
  "frontend/src/pages/admin/WaitlistManagement.tsx": "Shows a simple waitlist management page with no entries displayed.",
  "frontend/src/pages/admin/WaiverRecords.tsx": "Provides a page for viewing waiver records, currently showing no available records.",
  "frontend/src/pages/coming-soon/UnsupportedFeaturesHub.tsx": "Lists upcoming features with preview simulations and a modal to show step-by-step mock flows.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Provides an admin dashboard linking to various moderation, management, and analytics tools.",
  "frontend/src/pages/dashboards/CustomerDashboard.tsx": "Shows customer actions and summaries including bookings, reviews, assistance requests, and disputes.",
  "frontend/src/pages/dashboards/GarageOwnerDashboard.tsx": "Displays garage owner tools for managing listings, availability, and rental requests.",
  "frontend/src/pages/dashboards/MechanicDashboard.tsx": "Shows mechanic tools for managing profiles, availability, emergency settings, and incoming assistance requests.",
  "frontend/src/pages/disputes/Disputes.tsx": "Displays user disputes or prompts login if unauthenticated, showing either dispute count or a no‑disputes message.",
  "frontend/src/pages/fix-my-car/FixMyCarIntake.tsx": "Collects issue descriptions and media uploads, validates input, and navigates to results after a simulated submission.",
  "frontend/src/pages/fix-my-car/FixMyCarResults.tsx": "Shows repair cost estimates and links to browse mechanics or garage rentals based on the user’s issue.",
  "frontend/src/pages/garages/GarageBrowse.tsx": "Searches and filters available garages, offering list and placeholder map views with loading skeletons.",
  "frontend/src/pages/garages/GarageDetail.tsx": "Displays detailed garage info including pricing, tools, rules, photos, and reviews, with booking and DIY support modals.",
  "frontend/src/pages/garages/GarageListingEditor.tsx": "Placeholder page indicating the garage listing editor is coming soon.",
  "frontend/src/pages/Landing.tsx": "Implements the landing page with hero content, feature cards, and navigation links for core actions.",
  "frontend/src/pages/mechanics/MechanicBrowse.tsx": "Searches and filters mechanics, showing results or loading skeletons based on query state.",
  "frontend/src/pages/mechanics/MechanicProfileEditor.tsx": "Placeholder page indicating the mechanic profile editor is coming soon.",
  "frontend/src/pages/mechanics/MechanicProfilePublic.tsx": "Displays a simple public mechanic profile view with an ID and link back to browsing.",
  "frontend/src/pages/settings/MembershipSettings.tsx": "Shows membership status for signed‑in users with details for DIY and Pro tiers or prompts login if unauthenticated.",
  "frontend/src/pages/trust-safety/IdentityVerification.tsx": "React page that shows identity verification UI, prompting sign-in if unauthenticated and displaying current verification status with an upload button.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL or session.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing the project’s current state, requirements, features, issues, and architectural notes for the marketplace app."
}