{
  "kind": "build_request",
  "title": "Implement internal escrow ledger payments, Internet Identity RBAC, and in-app notifications (no Coming Soon)",
  "projectName": "NDNP Marketplace",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Implement Internet Identity–only role-based access control (RBAC) in the backend using a persisted role registry mapping Principal → Role (Admin, Mechanic, Customer, Garage Owner), and enforce it across all privileged backend methods.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-auth-1"
        ],
        "quotes": [
          "Keep authentication Internet Identity only.\n\nImplement:\n\nRole-based access control (RBAC)\n\nBackend role registry mapping Identity → Role (Admin, Mechanic, Customer, Garage Owner)"
        ]
      },
      "acceptanceCriteria": [
        "Backend persists role assignments per Principal and exposes query methods to read the caller’s role(s).",
        "Any backend method intended for admins/mechanics/garage owners rejects unauthorized callers with an explicit Unauthorized error (no silent failure).",
        "User profile saving cannot be used to self-assign the Admin role."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Add a backend-managed Admin whitelist for assigning the Admin role, and expose admin-check endpoints that the frontend can use for route protection.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-auth-2"
        ],
        "quotes": [
          "Admin role assigned via backend whitelist",
          "Middleware protecting admin routes",
          "401 Unauthorized for invalid access attempts"
        ]
      },
      "acceptanceCriteria": [
        "Only principals present in the backend whitelist can be treated as Admin.",
        "actor.isCallerAdmin() (or equivalent) returns true only for whitelisted principals.",
        "Unauthorized access attempts to admin-only backend methods trap with Unauthorized (mapped to 401-like handling in UI)."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Implement a provider-agnostic internal escrow ledger system in the backend with persisted transaction records and escrow account tracking per booking.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-payments-1"
        ],
        "quotes": [
          "Replace all external Stripe/PayPal integrations with a structured internal escrow ledger system.\n\nImplement:\n\nTransaction model with states: Pending → Held → Released → Refunded → Disputed\n\nEscrow account tracking per booking"
        ]
      },
      "acceptanceCriteria": [
        "Backend defines and persists a Transaction model including: booking reference, payer, payee, amount, platform fee, provider=INTERNAL_LEDGER, providerReferenceId optional, and status lifecycle compatible with Pending→Held→Released→Refunded→Disputed.",
        "Backend maintains escrow accounting per booking (held balance and ledger entries sufficient to audit credits/debits).",
        "All payment-related state changes are persisted and queryable after page refresh / reload."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Implement admin-controlled escrow actions in the backend: “Release Funds” and “Issue Refund”, including state-transition validation and auditability.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-payments-2"
        ],
        "quotes": [
          "Admin-controlled “Release Funds” and “Issue Refund” actions"
        ]
      },
      "acceptanceCriteria": [
        "Only Admin can release or refund funds.",
        "Release and refund operations validate current transaction status and reject invalid transitions (e.g., cannot release an already refunded transaction).",
        "Each release/refund operation results in persisted ledger entries and an updated Transaction status."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Enforce booking lifecycle gating in the backend so that a booking cannot be moved to Completed unless its escrow transaction is in Released state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-payments-3"
        ],
        "quotes": [
          "Booking cannot move to Completed unless funds are Released"
        ]
      },
      "acceptanceCriteria": [
        "Backend booking status update to Completed fails if associated transaction is not Released.",
        "When funds are Released successfully, booking can be moved to Completed via the existing booking flow logic.",
        "The rule applies consistently for all booking types that require payment (garage rental, mechanic service, combined)."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Design the payment backend interfaces to be payment-provider-agnostic so that a future Stripe Connect adapter can be added without changing booking flow or frontend UI component contracts.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-payments-4"
        ],
        "quotes": [
          "Design the payment architecture so that external payment APIs (e.g., Stripe Connect) can later replace the escrow release logic without modifying booking flow or UI components.",
          "Never store “Stripe logic” in your business tables."
        ]
      },
      "acceptanceCriteria": [
        "Transaction records include a provider enum and optional provider reference fields, but business logic does not require Stripe-specific fields.",
        "Frontend-facing API responses for payment/escrow do not expose provider-specific behavior; provider is informational.",
        "Switching provider from INTERNAL_LEDGER to another provider can be done behind backend method boundaries (no frontend changes required)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Replace simulated payment UI with functional internal-ledger payment flow in the booking experience, including explicit “Test Mode – Internal Ledger Active” labeling and no simulated card entry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-payments-5"
        ],
        "quotes": [
          "Clear “Test Mode – Internal Ledger Active” labeling in UI",
          "Do NOT simulate credit card entry or external API calls."
        ]
      },
      "acceptanceCriteria": [
        "PaymentMethodSelector no longer shows Apple Pay / Google Pay Coming Soon options or simulated modals, and does not show simulated “future payment processing” text.",
        "GarageBookingModal confirm flow is wired end-to-end: user action triggers backend payment/booking mutations, updates persisted state, and updates UI based on responses (no “(Simulated)” toasts).",
        "UI displays “Test Mode – Internal Ledger Active” wherever the user is confirming payment/escrow for a booking."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Create user-visible transaction history and booking payment status UI surfaces (per booking and per user) powered by backend queries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-payments-6"
        ],
        "quotes": [
          "Transaction model with states: Pending → Held → Released → Refunded → Disputed",
          "Escrow account tracking per booking"
        ]
      },
      "acceptanceCriteria": [
        "Signed-in users can view payment status for their bookings (Held/Released/Refunded/Disputed) in an appropriate dashboard section.",
        "Users can view a transaction history list (at minimum: booking reference, amount, status, timestamps).",
        "All displayed payment data comes from backend queries (no hardcoded placeholder rows)."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Add Admin UI to view transactions and perform escrow actions (Release Funds / Issue Refund) with proper authorization handling and state refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-admin-1"
        ],
        "quotes": [
          "Admin-controlled “Release Funds” and “Issue Refund” actions",
          "Role-based access control protecting admin pages."
        ]
      },
      "acceptanceCriteria": [
        "An admin-facing view lists transactions with filters/status indicators and provides action buttons for Release/Refund where valid.",
        "Attempting admin actions as a non-admin results in an access denied UI path (and backend denies).",
        "After admin action succeeds, affected booking/payment UI updates (React Query invalidation/refetch) without requiring a hard reload."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Implement a fully functional in-app notification system (backend + frontend) with notification types: BookingCreated, BookingConfirmed, FundsReleased, DisputeOpened, AccountSuspended.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent-notifications-1"
        ],
        "quotes": [
          "Replace all email/SMS notifications with a fully functional in-app notification center.\n\nImplement:\n\nNotification model (BookingCreated, BookingConfirmed, FundsReleased, DisputeOpened, AccountSuspended)"
        ]
      },
      "acceptanceCriteria": [
        "Backend persists notifications per user (read/unread state, created timestamp, type, reference id).",
        "Backend emits notifications on relevant events (at minimum: booking creation/confirmation, funds release, dispute opened, account suspension).",
        "Frontend can fetch notifications list and unread count and mark notifications as read."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Add a notification badge counter and dropdown in the top navigation that shows recent notifications and supports marking as read.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-notifications-2"
        ],
        "quotes": [
          "Real-time badge counter\n\nNotification dropdown"
        ]
      },
      "acceptanceCriteria": [
        "TopNav shows an unread badge count when unread notifications exist.",
        "Dropdown lists recent notifications with type + timestamp and links to the referenced entity when applicable.",
        "Marking a notification as read updates the unread count and the item’s read state."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Add a Notification Center dashboard page that lists all notifications with filtering (e.g., unread/all) and provides bulk actions (e.g., Mark all as read).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-notifications-3"
        ],
        "quotes": [
          "Notification center dashboard page"
        ]
      },
      "acceptanceCriteria": [
        "A dedicated page exists for viewing all notifications for the signed-in user.",
        "Page supports toggling between Unread and All (or equivalent) and bulk mark-as-read.",
        "Page is accessible via role-appropriate navigation without exposing admin-only routes to non-admins."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Implement toast alerts for notification-worthy events, driven by real backend mutations and subsequent query refresh (no simulated flows and no “Coming Soon” placeholders).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-notifications-4"
        ],
        "quotes": [
          "Toast alerts for live updates",
          "Do not display “Coming Soon” placeholders.",
          "All flows must include:\nUser Action → Backend Processing → Database Update → UI State Update."
        ]
      },
      "acceptanceCriteria": [
        "Key user actions (booking confirmed, dispute opened, funds released) show success/error toasts that reflect actual backend results.",
        "Toast messaging does not contain “Simulated” or “Coming Soon”.",
        "UI state after toasts matches backend state (e.g., booking status/payment status updated)."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Remove or refactor payment/messaging/escrow-related “Coming Soon” and simulated-flow UI so the app contains no “Coming Soon” placeholders for the scopes covered here (payments and notifications), including removing simulated modals from payment selection and removing/redirecting the escrow-related Coming Soon hub entry points.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-general-1"
        ],
        "quotes": [
          "Do not display “Coming Soon” placeholders.",
          "If a feature cannot be externally integrated, build a functional internal logic version with proper state handling and UI feedback."
        ]
      },
      "acceptanceCriteria": [
        "PaymentMethodSelector does not import/use ComingSoonBadge or SimulatedFlowModal.",
        "Any UI entry point that previously advertised “Escrow Payment” as Coming Soon is removed or updated to reflect the functional internal ledger escrow.",
        "No user-facing copy within the payments/notifications flow uses “Coming Soon” or “Simulated”."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if existing stable state must be upgraded.",
    "Do not integrate external payment providers (Stripe/PayPal) or simulate external API calls; implement internal ledger only.",
    "Do not implement email/SMS sending; notifications must be in-app only.",
    "Authentication must remain Internet Identity only; do not add email/password auth, password resets, 2FA, or email verification flows.",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing real-time messaging via WebSockets or any real-time transport beyond standard query/mutation refresh patterns.",
    "Integrating external maps providers or building interactive map pin availability for this request.",
    "Implementing Apple Pay / Google Pay payments (must be removed from current simulated UI for this scope).",
    "Implementing Stripe Connect adapters now (only ensure the schema/interfaces are provider-agnostic)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}