{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "NDNP Marketplace — Internal Ledger Payments UI + Transactions + In‑App Notifications (No Coming Soon)",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Replace simulated payment UI with a functional internal-ledger booking payment confirmation flow and explicit Test Mode labeling.",
      "acceptanceCriteria": [
        "PaymentMethodSelector no longer shows Apple Pay / Google Pay Coming Soon options or simulated modals, and does not show simulated “future payment processing” text.",
        "GarageBookingModal confirm flow is wired end-to-end: user action triggers backend payment/booking mutations, updates persisted state, and updates UI based on responses (no “(Simulated)” toasts).",
        "UI displays “Test Mode – Internal Ledger Active” wherever the user is confirming payment/escrow for a booking."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PaymentMethodSelector.tsx",
          "operation": "modify",
          "description": "Remove Apple Pay/Google Pay options, ComingSoonBadge, and SimulatedFlowModal usage; present a single internal-ledger method with explicit “Test Mode – Internal Ledger Active” labeling and no card-entry simulation."
        },
        {
          "path": "frontend/src/components/booking/GarageBookingModal.tsx",
          "operation": "modify",
          "description": "Replace the simulated confirm flow with a real backend mutation sequence for booking + internal-ledger escrow hold; show “Test Mode – Internal Ledger Active” on the payment tab; display success/error toasts based on actual backend results and close/refresh UI accordingly."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for internal-ledger booking payment mutations and any required payment-status queries used by GarageBookingModal; ensure mutations invalidate/refetch relevant cached queries to reflect persisted state changes."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the frontend backend interface typings with the internal-ledger payment/booking functions and payment status/transaction query types required by the booking flow UI."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add user-visible transaction history and per-booking payment status surfaces powered by backend queries.",
      "acceptanceCriteria": [
        "Signed-in users can view payment status for their bookings (Held/Released/Refunded/Disputed) in an appropriate dashboard section.",
        "Users can view a transaction history list (at minimum: booking reference, amount, status, timestamps).",
        "All displayed payment data comes from backend queries (no hardcoded placeholder rows)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/payments/TransactionHistory.tsx",
          "operation": "create",
          "description": "Create a signed-in user transaction history page that loads transactions via backend queries and renders booking reference, amount, status, and timestamps."
        },
        {
          "path": "frontend/src/components/payments/TransactionHistoryList.tsx",
          "operation": "create",
          "description": "Create a reusable list component for rendering transaction rows with status indicators and timestamps, driven entirely by queried backend data."
        },
        {
          "path": "frontend/src/components/payments/TransactionStatusBadge.tsx",
          "operation": "create",
          "description": "Create a small status badge component to map internal-ledger transaction states (Pending/Held/Released/Refunded/Disputed) into consistent UI indicators."
        },
        {
          "path": "frontend/src/pages/dashboards/CustomerDashboard.tsx",
          "operation": "modify",
          "description": "Add a dashboard section that shows the user’s recent transaction(s) and/or booking payment status using backend-powered query hooks, with a link into the full transaction history page."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks to fetch the signed-in user’s transaction history and any per-booking payment status needed by dashboard surfaces."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register routes for the new user transaction history page and ensure it is reachable via navigation (no orphan page)."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Add admin UI to list transactions and perform escrow actions (Release/Refund) with authorization handling and state refresh.",
      "acceptanceCriteria": [
        "An admin-facing view lists transactions with filters/status indicators and provides action buttons for Release/Refund where valid.",
        "Attempting admin actions as a non-admin results in an access denied UI path (and backend denies).",
        "After admin action succeeds, affected booking/payment UI updates (React Query invalidation/refetch) without requiring a hard reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/EscrowTransactions.tsx",
          "operation": "create",
          "description": "Create an admin-only transactions page that lists escrow transactions (with basic status filtering) and shows Release/Refund actions only when valid for the current status; handle unauthorized errors with an access denied UI path."
        },
        {
          "path": "frontend/src/pages/dashboards/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a new Admin Dashboard tool card that links to the escrow transactions admin page."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Ensure admin route guarding handles backend Unauthorized failures gracefully and routes to AccessDenied when the admin-check fails. Use the selected 'authorization' component’s admin-check capability pattern; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for admin transaction listing and admin escrow actions (Release Funds / Issue Refund), including query invalidation/refetch so state refresh happens without hard reload."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the frontend backend interface typings with admin escrow transaction query/action functions and any required types."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new admin escrow transactions route and wrap it with AdminRouteGuard so it cannot be accessed by non-admin users."
        },
        {
          "path": "frontend/src/components/layout/TopNav.tsx",
          "operation": "modify",
          "description": "Add an admin-only navigation entry to the escrow transactions page within the Admin section. Use the selected 'authorization' component’s admin-check capability pattern already present via isCallerAdmin; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Implement frontend notification center capabilities: fetch notifications/unread count and mark notifications as read, integrating with in-app UI surfaces.",
      "acceptanceCriteria": [
        "Backend persists notifications per user (read/unread state, created timestamp, type, reference id).",
        "Backend emits notifications on relevant events (at minimum: booking creation/confirmation, funds release, dispute opened, account suspension).",
        "Frontend can fetch notifications list and unread count and mark notifications as read."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useNotifications.ts",
          "operation": "create",
          "description": "Create dedicated React Query hooks for notifications: fetch unread count, fetch recent list, fetch full list, mark one as read, and bulk mark as read."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the frontend backend interface typings with notification types (BookingCreated, BookingConfirmed, FundsReleased, DisputeOpened, AccountSuspended) and notification query/mutation functions used by the frontend."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "If needed for consistency, re-export or bridge notification hooks and ensure any existing flows that should refresh notifications invalidate/refetch the notification queries after successful mutations."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Add a notification badge counter and dropdown in TopNav that shows recent notifications and supports marking as read.",
      "acceptanceCriteria": [
        "TopNav shows an unread badge count when unread notifications exist.",
        "Dropdown lists recent notifications with type + timestamp and links to the referenced entity when applicable.",
        "Marking a notification as read updates the unread count and the item’s read state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/notifications/NotificationDropdown.tsx",
          "operation": "create",
          "description": "Create a TopNav-ready notification dropdown component that displays unread badge count, recent notifications, and supports marking items as read while keeping UI in sync via React Query."
        },
        {
          "path": "frontend/src/components/layout/TopNav.tsx",
          "operation": "modify",
          "description": "Integrate the notification dropdown + badge into the top navigation and wire links to referenced entities (when applicable) and to the full Notification Center page."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Add a Notification Center dashboard page with filtering and bulk mark-as-read, and ensure navigation is role-appropriate.",
      "acceptanceCriteria": [
        "A dedicated page exists for viewing all notifications for the signed-in user.",
        "Page supports toggling between Unread and All (or equivalent) and bulk mark-as-read.",
        "Page is accessible via role-appropriate navigation without exposing admin-only routes to non-admins."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/notifications/NotificationCenter.tsx",
          "operation": "create",
          "description": "Create a Notification Center page that lists all notifications, supports Unread/All filtering, and provides a bulk “Mark all as read” action using backend-driven mutations and query refresh."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the Notification Center route and ensure it renders under the standard layout."
        },
        {
          "path": "frontend/src/components/layout/TopNav.tsx",
          "operation": "modify",
          "description": "Add a non-admin navigation path to Notification Center (e.g., in the user dropdown and/or via notification dropdown) without exposing admin-only routes to non-admin users."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Implement toast alerts for notification-worthy events using real backend mutations and query refresh (no simulated flows).",
      "acceptanceCriteria": [
        "Key user actions (booking confirmed, dispute opened, funds released) show success/error toasts that reflect actual backend results.",
        "Toast messaging does not contain “Simulated” or “Coming Soon”.",
        "UI state after toasts matches backend state (e.g., booking status/payment status updated)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/booking/GarageBookingModal.tsx",
          "operation": "modify",
          "description": "Ensure booking confirmation/payment hold uses real backend mutations and emits success/error toasts that reflect actual results, followed by React Query invalidation/refetch so UI matches backend state."
        },
        {
          "path": "frontend/src/pages/admin/EscrowTransactions.tsx",
          "operation": "modify",
          "description": "Show success/error toasts for Release/Refund actions driven by real backend mutations, and invalidate/refetch both admin transaction lists and any related user-facing payment queries."
        },
        {
          "path": "frontend/src/pages/disputes/Disputes.tsx",
          "operation": "modify",
          "description": "Add a real dispute-open mutation UI (minimal form) that triggers backend processing and shows success/error toasts; refresh the disputes list and notifications queries after mutation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove placeholder dispute hooks for this scope and replace them with real actor-backed query/mutation hooks used by Disputes, including cache invalidation to keep UI consistent after toasts."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Remove/refactor payments and notifications “Coming Soon” and simulated flows so user-facing copy contains no “Coming Soon”/“Simulated” in these scopes.",
      "acceptanceCriteria": [
        "PaymentMethodSelector does not import/use ComingSoonBadge or SimulatedFlowModal.",
        "Any UI entry point that previously advertised “Escrow Payment” as Coming Soon is removed or updated to reflect the functional internal ledger escrow.",
        "No user-facing copy within the payments/notifications flow uses “Coming Soon” or “Simulated”."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PaymentMethodSelector.tsx",
          "operation": "modify",
          "description": "Delete ComingSoonBadge and SimulatedFlowModal imports/usage; remove Apple Pay/Google Pay options and remove any “future payment processing” placeholder copy from the payments flow."
        },
        {
          "path": "frontend/src/components/booking/GarageBookingModal.tsx",
          "operation": "modify",
          "description": "Remove/replace any payment-flow copy that says “coming soon” or “(Simulated)”, and ensure confirm produces real backend-driven state changes and toasts."
        },
        {
          "path": "frontend/src/pages/coming-soon/UnsupportedFeaturesHub.tsx",
          "operation": "modify",
          "description": "Remove the “Escrow Payment” and “Push Notifications” cards (and any associated simulated previews) so escrow/notifications are no longer presented as Coming Soon; update page copy/title to avoid “Coming Soon” phrasing for these scopes."
        },
        {
          "path": "frontend/src/components/layout/TopNav.tsx",
          "operation": "modify",
          "description": "Remove or rename the “Coming Soon Features” navigation entry to avoid advertising escrow/notifications as coming soon; ensure no payments/notifications navigation path points to a simulated preview."
        }
      ]
    }
  ]
}